espressif/esp-idf/components/soc/esp32s31/include/soc/gpio_sig_map.h
#define LEDC1_LS_SIG_OUT_PAD_OUT0_IDX           230
#define CORE_GPIO_IN_PAD_IN17_IDX               231
#define LEDC1_LS_SIG_OUT_PAD_OUT1_IDX           231
#define CORE_GPIO_IN_PAD_IN18_IDX               232
#define LEDC1_LS_SIG_OUT_PAD_OUT2_IDX           232
#define CORE_GPIO_IN_PAD_IN19_IDX               233
#define LEDC1_LS_SIG_OUT_PAD_OUT3_IDX           233
#define CORE_GPIO_IN_PAD_IN20_IDX               234
#define LEDC1_LS_SIG_OUT_PAD_OUT4_IDX           234
#define CORE_GPIO_IN_PAD_IN21_IDX               235
#define LEDC1_LS_SIG_OUT_PAD_OUT5_IDX           235
#define CORE_GPIO_IN_PAD_IN22_IDX               236
#define LEDC1_LS_SIG_OUT_PAD_OUT6_IDX           236
#define CORE_GPIO_IN_PAD_IN23_IDX               237
#define LEDC1_LS_SIG_OUT_PAD_OUT7_IDX           237
#define CORE_GPIO_IN_PAD_IN24_IDX               238
#define GMAC_PHY_TXD4_PAD_OUT_IDX               238
#define CORE_GPIO_IN_PAD_IN25_IDX               239
#define GMAC_PHY_TXD5_PAD_OUT_IDX               239
#define CORE_GPIO_IN_PAD_IN26_IDX               240
#define GMAC_PHY_TXD6_PAD_OUT_IDX               240
#define CORE_GPIO_IN_PAD_IN27_IDX               241
#define GMAC_PHY_TXD7_PAD_OUT_IDX               241
#define CORE_GPIO_IN_PAD_IN28_IDX               242
#define CORE_GPIO_IN_PAD_IN29_IDX               243
#define CORE_GPIO_IN_PAD_IN30_IDX               244
#define ANA_COMP0_OUT_IDX                       244
#define CORE_GPIO_IN_PAD_IN31_IDX               245
#define DBG_CH2_CLK_IDX                         245
#define RMT_SIG_IN0_IDX                         246
#define RMT_SIG_OUT0_IDX                        246
#define RMT_SIG_IN1_IDX                         247
#define RMT_SIG_OUT1_IDX                        247
#define RMT_SIG_IN2_IDX                         248
#define RMT_SIG_OUT2_IDX                        248
#define RMT_SIG_IN3_IDX                         249
#define RMT_SIG_OUT3_IDX                        249
#define SIG_IN_FUNC251_IDX                      251
#define SIG_IN_FUNC251_IDX                      251
#define SIG_IN_FUNC252_IDX                      252
#define SIG_IN_FUNC252_IDX                      252
#define SIG_IN_FUNC253_IDX                      253
#define SIG_IN_FUNC253_IDX                      253
#define SIG_IN_FUNC254_IDX                      254
#define SIG_IN_FUNC254_IDX                      254
#define SIG_IN_FUNC255_IDX                      255
#define SIG_IN_FUNC255_IDX                      255
// version date 2312260
#define SIG_GPIO_OUT_IDX                        256

#define ANT_SEL0_IDX  PAD_MODEM_ANT_SEL0_IDX
#define ANT_SEL1_IDX  PAD_MODEM_ANT_SEL1_IDX
#define ANT_SEL2_IDX  PAD_MODEM_ANT_SEL2_IDX
#define ANT_SEL3_IDX  PAD_MODEM_ANT_SEL3_IDX
#define ANT_SEL4_IDX  PAD_MODEM_ANT_SEL4_IDX
#define ANT_SEL5_IDX  PAD_MODEM_ANT_SEL5_IDX
#define ANT_SEL6_IDX  PAD_MODEM_ANT_SEL6_IDX
#define ANT_SEL7_IDX  PAD_MODEM_ANT_SEL7_IDX
#define ANT_SEL8_IDX  PAD_MODEM_ANT_SEL8_IDX
#define ANT_SEL9_IDX  PAD_MODEM_ANT_SEL9_IDX
#define ANT_SEL10_IDX  PAD_MODEM_ANT_SEL10_IDX
#define ANT_SEL11_IDX  PAD_MODEM_ANT_SEL11_IDX
#define ANT_SEL12_IDX  PAD_MODEM_ANT_SEL12_IDX
#define ANT_SEL13_IDX  PAD_MODEM_ANT_SEL13_IDX
#define ANT_SEL14_IDX  PAD_MODEM_ANT_SEL14_IDX
#define ANT_SEL15_IDX  PAD_MODEM_ANT_SEL15_IDX
